Revit 2026 API

# Ceramic Properties

---

The Ceramic type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CeramicApplication | The property labeled "Finish" from the "Ceramic" schema. |
|  | CeramicBump | The property labeled "Type" from the "Ceramic" schema. |
|  | CeramicBumpAmount | The property labeled "Amount" from the "Ceramic" schema. |
|  | CeramicBumpMap | The property labeled "Image" from the "Ceramic" schema. |
|  | CeramicColor | The property labeled "Color" from the "Ceramic" schema. |
|  | CeramicColorByObject | The property labeled "Color" from the "Ceramic" schema. |
|  | CeramicPattern | The property labeled "Relief Pattern" from the "Ceramic" schema. |
|  | CeramicPatternAmount | The property labeled "Amount" from the "Ceramic" schema. |
|  | CeramicPatternMap | The property labeled "Image" from the "Ceramic" schema. |
|  | CeramicType | The property labeled "Type" from the "Ceramic" schema. |
|  | CommonTintColor | The property labeled "Tint Color" from the "Ceramic" schema. |
|  | CommonTintToggle | The property labeled "Tint" from the "Ceramic" schema. |

#### Reference

Ceramic Class

Autodesk.Revit.DB.Visual Namespace